## 데이터 프레임 정보

In [1]:
import pandas as pd
df = pd.DataFrame({
    "학번": ['A1021','A1022', 'A1023', 'A1024'],  
    "이름": ['김용명','다나카','유재석','이용진'], 
    "수학": ['92', '100', '73', '89'],
    "영어": ['88', '75', '45', '98'],
    "국어": ['69', '96', '100','74'],
    '출석': [True,True,False,False],
    '제출일':['20230501','20230502','20230502','20230506']
})
df

      학번   이름   수학  영어   국어     출석       제출일
0  A1021  김용명   92  88   69   True  20230501
1  A1022  다나카  100  75   96   True  20230502
2  A1023  유재석   73  45  100  False  20230502
3  A1024  이용진   89  98   74  False  20230506

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학번      4 non-null      object
 1   이름      4 non-null      object
 2   수학      4 non-null      object
 3   영어      4 non-null      object
 4   국어      4 non-null      object
 5   출석      4 non-null      bool
 6   제출일     4 non-null      object
dtypes: bool(1), object(6)
memory usage: 324.0+ bytes

In [3]:
df.shape   # 행, 열에 대한 정보

(4, 7)

In [4]:
df.size   # 데이터 개수: values

28

In [5]:
len(df)   # 관측치 수, 행 수

4

In [6]:
df.describe()   # 기초 통계 정보이기 때문에: 수치형 데이터일 때만 의미있음.

           학번   이름  수학  영어  국어    출석       제출일
count       4    4   4   4   4     4         4
unique      4    4   4   4   4     2         3
top     A1021  김용명  92  88  69  True  20230502
freq        1    1   1   1   1     2         2

In [9]:
#수학 제일 잘한 사람은?
df.sort_values(by = '수학', ascending=False)

      학번   이름   수학  영어   국어     출석       제출일
0  A1021  김용명   92  88   69   True  20230501
3  A1024  이용진   89  98   74  False  20230506
2  A1023  유재석   73  45  100  False  20230502
1  A1022  다나카  100  75   96   True  20230502

```
수학 100점인 다나카가 제일 상위에 출력되어야 하는데
왜? 김용명이 제일 위에 올까?
```

In [11]:
df.sort_values(by = '수학', ascending=True)

      학번   이름   수학  영어   국어     출석       제출일
1  A1022  다나카  100  75   96   True  20230502
2  A1023  유재석   73  45  100  False  20230502
3  A1024  이용진   89  98   74  False  20230506
0  A1021  김용명   92  88   69   True  20230501

## 형 변환

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학번      4 non-null      object
 1   이름      4 non-null      object
 2   수학      4 non-null      object
 3   영어      4 non-null      object
 4   국어      4 non-null      object
 5   출석      4 non-null      bool
 6   제출일     4 non-null      object
dtypes: bool(1), object(6)
memory usage: 324.0+ bytes

In [13]:
df['수학'] = df['수학'].astype('int64')   # 수학 컬럼 수치형으로 바꾸기
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학번      4 non-null      object
 1   이름      4 non-null      object
 2   수학      4 non-null      int64
 3   영어      4 non-null      object
 4   국어      4 non-null      object
 5   출석      4 non-null      bool
 6   제출일     4 non-null      object
dtypes: bool(1), int64(1), object(5)
memory usage: 324.0+ bytes

In [15]:
#수학은 정수, 영어와 국어는 실수로 변환하기
df['국어'] = df['국어'].astype('float64')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학번      4 non-null      object
 1   이름      4 non-null      object
 2   수학      4 non-null      int64
 3   영어      4 non-null      object
 4   국어      4 non-null      float64
 5   출석      4 non-null      bool
 6   제출일     4 non-null      object
dtypes: bool(1), float64(1), int64(1), object(4)
memory usage: 324.0+ bytes

In [20]:
#수학 제일 잘 한사람은?
df.sort_values(by = '수학', ascending=False, inplace=True)
df
df.iloc[0,1]

'다나카'

In [25]:
# 수학 1등과 꼴등의 점수 차
df
#a = df.iloc[0,2]
#b = df.iloc[3,2]
#a-b

df.head(1)['수학'].values[0] - df.tail(1)['수학'].values[0]

27

## 날짜 변환

In [26]:
df['제출일'] = pd.to_datetime(df['제출일'])
df.head()

      학번   이름   수학  영어     국어     출석        제출일
1  A1022  다나카  100  75   96.0   True 2023-05-02
0  A1021  김용명   92  88   69.0   True 2023-05-01
3  A1024  이용진   89  98   74.0  False 2023-05-06
2  A1023  유재석   73  45  100.0  False 2023-05-02

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 1 to 2
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학번      4 non-null      object
 1   이름      4 non-null      object
 2   수학      4 non-null      int64
 3   영어      4 non-null      object
 4   국어      4 non-null      float64
 5   출석      4 non-null      bool
 6   제출일     4 non-null      datetime64[ns]
dtypes: bool(1), datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 228.0+ bytes

In [28]:
df['제출일']

1   2023-05-02
0   2023-05-01
3   2023-05-06
2   2023-05-02
Name: 제출일, dtype: datetime64[ns]

In [30]:
df['제출일'].dt.day

1    2
0    1
3    6
2    2
Name: 제출일, dtype: int32

In [31]:
# datetime형일 때, dt 객체를 사용할 수 있다.
df['년'] = df['제출일'].dt.year
df['월'] = df['제출일'].dt.month
df['일'] = df['제출일'].dt.day

In [32]:
df.head()

      학번   이름   수학  영어     국어     출석        제출일     년  월  일
1  A1022  다나카  100  75   96.0   True 2023-05-02  2023  5  2
0  A1021  김용명   92  88   69.0   True 2023-05-01  2023  5  1
3  A1024  이용진   89  98   74.0  False 2023-05-06  2023  5  6
2  A1023  유재석   73  45  100.0  False 2023-05-02  2023  5  2